print('''
-----------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                   英雄联盟                                      
----------------------------------------------------------------------------------------------------------------------------------------------------------
''')
person = input("请选择英雄")
print('你已成功选择英雄 {}' .format(person))
print('欢迎来到王者峡谷')
zhuangbei = input('请购买你的装备')
money = input('请输入金额')
print('购买成功！消费{}元' .format(money))
ss = input('按回车继续')
print('抱歉！您的网络不稳定。已掉线')
s = input('请按回车重新连接')
print('连接失败，你已被禁赛')
input('')



